In [1]:
%%HTML
<style>
.rendered_html table, .rendered_html th, .rendered_html tr, .rendered_html td {
     font-size: 90%;
}
</style>

# Analiza i bazy danych

## Obróbka danych w pakiecie pandas

### dr hab. inż. Jerzy Baranowski, Prof. AGH

# pandas - Python DAta ANalisyS library
![](img/pandas.svg)

# Konstrukcja

pandas opiera się o pakiety **Numpy** i **Matplotlib**

# Przykładowy zbiór danych

| Name     | Breed        | Color  | Height (cm)  | Weight (kg)  | Date of Birth  |
|----------|--------------|--------|--------------|--------------|----------------|
| Bella    | Labrador     | Brown  | 56           | 25           | 01.07.2013     |
| Charlie  | Poodle       | Black  | 43           | 23           | 16.09.2016     |
| Lucy     | Chow Chow    | Brown  | 46           | 22           | 25.08.2014     |
| Cooper   | Schnauzer    | Gray   | 49           | 17           | 11.12.2011     |
| Max      | Labrador     | Black  | 59           | 29           | 20.01.2017     |
| Stella   | Chihuahua    | Tan    | 18           | 2            | 20.04.2015     |
| Bernie   | St. Bernard  | White  | 77           | 74           | 27.02.2018     |

In [2]:
import pandas as pd
dogs = pd.read_csv('dogs.csv',sep=';')
dogs.columns=dogs.columns.str.rstrip()
dogs.Name=dogs.Name.str.rstrip()
dogs.Breed=dogs.Breed.str.rstrip()
dogs.Color=dogs.Color.str.rstrip()

dogs.dropna(inplace=True)
dogs.reset_index(inplace=True)
dogs['Date of Birth']=pd.to_datetime(dogs['Date of Birth'])
dogs.drop('index',axis=1,inplace=True)
dogs.to_csv('dogs_clean.csv',index=False)

# Data frame

- Podstawowy obiekt w analizie danych
- Występuje w wielu językach i wielu formach:
    - np. w R ```data frame```, ```tibble```, ```data_table```
    - w Pythonie pandas ```DataFrame```
    - w Julii ```DataFrames.jl```

# Data frame
- reprezentacja tabeli
- zbiór metod, które pozwalają na jej obsługę
- indeksowana

In [3]:
import pandas as pd
dogs = pd.read_csv('dogs_clean.csv')

In [4]:
print(dogs)

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
4      Max     Labrador  Black         59.0         29.0    2017-01-20
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [5]:
dogs.head()

      Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella   Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie     Poodle  Black         43.0         23.0    2016-09-16
2     Lucy  Chow Chow  Brown         46.0         22.0    2014-08-25
3   Cooper  Schnauzer   Gray         49.0         17.0    2011-11-12
4      Max   Labrador  Black         59.0         29.0    2017-01-20

In [6]:
dogs.tail()

     Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
2    Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
3  Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
4     Max     Labrador  Black         59.0         29.0    2017-01-20
5  Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6  Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [7]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height (cm)    7 non-null      float64
 4   Weight (kg)    7 non-null      float64
 5   Date of Birth  7 non-null      object
dtypes: float64(2), object(4)
memory usage: 464.0+ bytes

In [8]:
dogs.shape

(7, 6)

In [9]:
dogs.describe()

       Height (cm)  Weight (kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000

In [10]:
dogs.describe(include='all')

          Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
count        7         7      7     7.000000     7.000000             7
unique       7         6      5          NaN          NaN             7
top     Bernie  Labrador  Black          NaN          NaN    2015-04-20
freq         1         2      2          NaN          NaN             1
mean       NaN       NaN    NaN    49.714286    27.428571           NaN
std        NaN       NaN    NaN    17.960274    22.292429           NaN
min        NaN       NaN    NaN    18.000000     2.000000           NaN
25%        NaN       NaN    NaN    44.500000    19.500000           NaN
50%        NaN       NaN    NaN    49.000000    23.000000           NaN
75%        NaN       NaN    NaN    57.500000    27.000000           NaN
max        NaN       NaN    NaN    77.000000    74.000000           NaN

In [11]:
dogs.values

array([['Bella', 'Labrador', 'Brown', 56.0, 25.0, '2013-01-07'],
       ['Charlie', 'Poodle', 'Black', 43.0, 23.0, '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Brown', 46.0, 22.0, '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gray', 49.0, 17.0, '2011-11-12'],
       ['Max', 'Labrador', 'Black', 59.0, 29.0, '2017-01-20'],
       ['Stella', 'Chihuahua', 'Tan', 18.0, 2.0, '2015-04-20'],
       ['Bernie', 'St. Bernard', 'White', 77.0, 74.0, '2018-02-27']],
      dtype=object)

In [12]:
dogs.columns

Index(['Name', 'Breed', 'Color', 'Height (cm)', 'Weight (kg)',
       'Date of Birth'],
      dtype='object')

In [13]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

In [14]:
type(dogs)

pandas.core.frame.DataFrame

### Wyciąganie danych z data frame'ów

In [15]:
dogs['Breed']

0       Labrador
1         Poodle
2      Chow Chow
3      Schnauzer
4       Labrador
5      Chihuahua
6    St. Bernard
Name: Breed, dtype: object

In [16]:
dogs.Breed

0       Labrador
1         Poodle
2      Chow Chow
3      Schnauzer
4       Labrador
5      Chihuahua
6    St. Bernard
Name: Breed, dtype: object

Problem jak jest spacja

In [17]:
dogs['Weight (kg)']

0    25.0
1    23.0
2    22.0
3    17.0
4    29.0
5     2.0
6    74.0
Name: Weight (kg), dtype: float64

Można więcej kolumn

In [18]:
dogs[["Breed", "Height (cm)"]]

         Breed  Height (cm)
0     Labrador         56.0
1       Poodle         43.0
2    Chow Chow         46.0
3    Schnauzer         49.0
4     Labrador         59.0
5    Chihuahua         18.0
6  St. Bernard         77.0

In [19]:
lista=["Breed", "Height (cm)"]
dogs[lista]

         Breed  Height (cm)
0     Labrador         56.0
1       Poodle         43.0
2    Chow Chow         46.0
3    Schnauzer         49.0
4     Labrador         59.0
5    Chihuahua         18.0
6  St. Bernard         77.0

### Filtrowanie

In [20]:
dogs['Weight (kg)']>20

0     True
1     True
2     True
3    False
4     True
5    False
6     True
Name: Weight (kg), dtype: bool

In [21]:
dogs[dogs['Weight (kg)']>20]

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
4      Max     Labrador  Black         59.0         29.0    2017-01-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [22]:
dogs[dogs['Date of Birth']> "2015-01-01"]

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
4      Max     Labrador  Black         59.0         29.0    2017-01-20
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [23]:
dogs[dogs["Breed"] == "Labrador"]

    Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown         56.0         25.0    2013-01-07
4    Max  Labrador  Black         59.0         29.0    2017-01-20

### Łączenie warunków

In [24]:
is_lab = dogs["Breed"] == "Labrador" 
is_brown = dogs["Color"] == "Brown"
dogs[is_lab & is_brown]

    Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown         56.0         25.0    2013-01-07

In [25]:
dogs[(dogs["Breed"] == "Labrador" )&(dogs["Color"] == "Brown")]

    Name     Breed  Color  Height (cm)  Weight (kg) Date of Birth
0  Bella  Labrador  Brown         56.0         25.0    2013-01-07

# Analiza i bazy danych

## Obróbka danych w pakiecie pandas

### dr hab. inż. Jerzy Baranowski, Prof. AGH

### Sortowanie

In [26]:
dogs.sort_values('Breed')

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
4      Max     Labrador  Black         59.0         29.0    2017-01-20
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

In [27]:
dogs.sort_values(['Color','Breed'])

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
4      Max     Labrador  Black         59.0         29.0    2017-01-20
1  Charlie       Poodle  Black         43.0         23.0    2016-09-16
2     Lucy    Chow Chow  Brown         46.0         22.0    2014-08-25
0    Bella     Labrador  Brown         56.0         25.0    2013-01-07
3   Cooper    Schnauzer   Gray         49.0         17.0    2011-11-12
5   Stella    Chihuahua    Tan         18.0          2.0    2015-04-20
6   Bernie  St. Bernard  White         77.0         74.0    2018-02-27

## Struktury danych w pandas
### Podstawowe elementy
 - index - ciągi etykiet
 - Series - tablica jednowymiarowa z indeksem
 - DataFrame - tablica dwuwymiarowa z szeregami jako kolumnami
 
### Indeksy
 - Immutable
 - Jednorodne w typie danych

## Tworzenie szeregu

In [28]:
prices = [10.70, 10.86, 10.74, 10.71, 10.79] 
shares = pd.Series(prices)
print(shares)

0    10.70
1    10.86
2    10.74
3    10.71
4    10.79
dtype: float64

## Tworzenie indeksu

In [29]:
days = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri'] 
shares = pd.Series(prices, index=days)
print(shares)

Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

## Zmiana nazwy indeksu

In [30]:
shares.index.name = 'weekday'
print(shares)

weekday
Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

## Zmiana wszystkich elementów indeksu

In [31]:
shares.index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
print(shares)

Monday       10.70
Tuesday      10.86
Wednesday    10.74
Thursday     10.71
Friday       10.79
dtype: float64

In [32]:
dogs.index=dogs.Name
dogs.head()

            Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
Name
Bella      Bella   Labrador  Brown         56.0         25.0    2013-01-07
Charlie  Charlie     Poodle  Black         43.0         23.0    2016-09-16
Lucy        Lucy  Chow Chow  Brown         46.0         22.0    2014-08-25
Cooper    Cooper  Schnauzer   Gray         49.0         17.0    2011-11-12
Max          Max   Labrador  Black         59.0         29.0    2017-01-20

In [33]:
dogs.drop('Name',axis=1,inplace=True) 
dogs.head()

             Breed  Color  Height (cm)  Weight (kg) Date of Birth
Name
Bella     Labrador  Brown         56.0         25.0    2013-01-07
Charlie     Poodle  Black         43.0         23.0    2016-09-16
Lucy     Chow Chow  Brown         46.0         22.0    2014-08-25
Cooper   Schnauzer   Gray         49.0         17.0    2011-11-12
Max       Labrador  Black         59.0         29.0    2017-01-20

##  .loc

In [34]:
dogs.loc['Bella']

Breed              Labrador
Color                 Brown
Height (cm)              56
Weight (kg)              25
Date of Birth    2013-01-07
Name: Bella, dtype: object

In [35]:
dogs.loc['Charlie':'Cooper']

             Breed  Color  Height (cm)  Weight (kg) Date of Birth
Name
Charlie     Poodle  Black         43.0         23.0    2016-09-16
Lucy     Chow Chow  Brown         46.0         22.0    2014-08-25
Cooper   Schnauzer   Gray         49.0         17.0    2011-11-12

In [36]:
dogs.loc['Charlie':'Cooper','Breed']

Name
Charlie       Poodle
Lucy       Chow Chow
Cooper     Schnauzer
Name: Breed, dtype: object

In [37]:
dogs.loc['Charlie':'Cooper','Height (cm)':'Weight (kg)']

         Height (cm)  Weight (kg)
Name
Charlie         43.0         23.0
Lucy            46.0         22.0
Cooper          49.0         17.0

## .iloc

In [38]:
dogs.iloc[0]

Breed              Labrador
Color                 Brown
Height (cm)              56
Weight (kg)              25
Date of Birth    2013-01-07
Name: Bella, dtype: object

In [39]:
dogs.iloc[0, [1,2,4]]

Color                 Brown
Height (cm)              56
Date of Birth    2013-01-07
Name: Bella, dtype: object

## Grupowanie danych

In [40]:
sales = pd.DataFrame( {
 'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
 'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
 'bread': [139, 237, 326, 456],
 'butter': [20, 45, 70, 98]
} )
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [41]:
sales.loc[sales['weekday'] == 'Sun'].count()

weekday    2
city       2
bread      2
butter     2
dtype: int64

In [42]:
sales.groupby('weekday').count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

## Działanie groupby
 - sales.groupby('weekday').count() 
     - dzieli po ‘weekday’
     - stosuje funkcję count() na każdej grupie
     - łączy elementy w grupach
 - musimy zastosować funkcję agregującą np. 
     - mean()
     - std()
     - sum() 
     - first(), last()
     - min(), max()

In [43]:
sales.groupby('weekday')['bread'].sum()

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

In [44]:
## można wiele kolumn
sales.groupby('weekday')[['bread','butter']].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

In [45]:
## lub stworzyć wielopoziomowy indeks
sales.groupby(['city','weekday']).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [46]:
## lub wiele agregacji
sales.groupby('city')[['bread','butter']].agg(['max','sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

In [47]:
## lub własne funkcje agregujące
def data_range(series):
    return series.max() - series.min()
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

## Przestawianie

In [48]:
sales.pivot(index = 'city', columns = 'weekday', values='bread'  )

weekday  Mon  Sun
city
Austin   326  139
Dallas   456  237

## Tabela przestawna

In [49]:
import numpy as np
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [50]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [51]:
table = pd.pivot_table(df, values='D', index=['A'],
                    columns=['C'], aggfunc=np.sum)
table

C    large  small
A
bar     11     11
foo      4      7

In [52]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [53]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

## Melt - zamiana szerokich tabel na wąskie

In [54]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})

In [55]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [56]:
df.melt()

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

## Istotne kwargi

- ```id_vars``` zmienne identyfikujące
- ```value_vars``` wartości do rozprowadzenia
- ```var_name``` nazwa kolumny określającej zmienne
- ```value_name``` nazwa kolumny z wartościami

In [57]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [58]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [59]:
pd.melt(df, id_vars=['A'], value_vars=['B'],
        var_name='myVarname', value_name='myValname')

   A myVarname  myValname
0  a         B          1
1  b         B          3
2  c         B          5

## Inne metody o zbliżonych zastosowaniach
- ```pd.wide_to_long()```
- ```df.explode()```

## Wierzchołek góry lodowej
- multi indeksy (we własnym zakresie)
- datetime (przy szeregach czasowych)
- wizualizacja (przy EDA)